Revit 2027 API
LineProperties.PatternId Property
 Id of the current Line pattern element used when drawing lines/curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId PatternId { get; }
Public ReadOnly Property PatternId As ElementId
	Get
public:
property ElementId^ PatternId {
	ElementId^ get ();
}
member PatternId : ElementId with get
Property Value
ElementId
See Also
Reference
LineProperties Class
Autodesk.Revit.DB Namespace